In [37]:
import numpy as np
import pandas as pd

In [38]:
arr = np.arange(20).reshape(5,4)
df = pd.DataFrame(arr, index=['Row1','Row2','Row3','Row4','Row5'],columns=['Column1','Column2','Column3','Column4'])
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.to_dict()

{'Column1': {'Row1': 0, 'Row2': 4, 'Row3': 8, 'Row4': 12, 'Row5': 16},
 'Column2': {'Row1': 1, 'Row2': 5, 'Row3': 9, 'Row4': 13, 'Row5': 17},
 'Column3': {'Row1': 2, 'Row2': 6, 'Row3': 10, 'Row4': 14, 'Row5': 18},
 'Column4': {'Row1': 3, 'Row2': 7, 'Row3': 11, 'Row4': 15, 'Row5': 19}}

In [41]:
df.to_csv('test.csv')

In [42]:
#display first n rows (default n is 5)
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [43]:
df.shape

(5, 4)

In [44]:
df.head(3)

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [45]:
df.tail(3)

      Column1  Column2  Column3  Column4
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [46]:
#accessing the elements
# df.loc and df.iloc
df.loc['Row3']

Column1     8
Column2     9
Column3    10
Column4    11
Name: Row3, dtype: int64

In [47]:
type(df.loc['Row3'])

pandas.core.series.Series

In [48]:
df.iloc[1]

Column1    4
Column2    5
Column3    6
Column4    7
Name: Row2, dtype: int64

In [49]:
df.iloc[0:3,0:2]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9

In [50]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [51]:
#convert dataframes into array
df.iloc[:,:].values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [52]:
type(df.iloc[:,:].values)

numpy.ndarray

In [53]:
# check any col contains null value
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [54]:
df.columns

Index(['Column1', 'Column2', 'Column3', 'Column4'], dtype='object')

In [55]:
df['Column1'].value_counts()

Column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [56]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])